In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [3]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                  'k2':['alpha', 'beta', 'alpha', 'beta','aplpha'],
                  'dataset1':np.random.randn(5),
                  'dataset2':np.random.randn(5)})

In [4]:
dframe

  k1      k2  dataset1  dataset2
0  X   alpha -1.838315  0.438221
1  X    beta -1.409514 -0.643389
2  Y   alpha -1.004341  0.371550
3  Y    beta -0.352099 -2.543015
4  Z  aplpha -0.055688  1.662385

In [5]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [6]:
group1

In [7]:
group1.mean()

k1
X   -1.623914
Y   -0.678220
Z   -0.055688
Name: dataset1, dtype: float64

In [8]:
cities = np.array(['NY', 'LA', 'LA', 'NY', 'NY'])
month = np.array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN'])

In [9]:
dframe

  k1      k2  dataset1  dataset2
0  X   alpha -1.838315  0.438221
1  X    beta -1.409514 -0.643389
2  Y   alpha -1.004341  0.371550
3  Y    beta -0.352099 -2.543015
4  Z  aplpha -0.055688  1.662385

In [10]:
dframe['dataset1'].groupby([cities, month]).mean()

LA  FEB   -1.409514
    JAN   -1.004341
NY  FEB   -0.352099
    JAN   -0.947002
Name: dataset1, dtype: float64

In [11]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -1.623914 -0.102584
Y  -0.678220 -1.085732
Z  -0.055688  1.662385

In [12]:
dframe.groupby(['k1', 'k2']).mean()

           dataset1  dataset2
k1 k2
X  alpha  -1.838315  0.438221
   beta   -1.409514 -0.643389
Y  alpha  -1.004341  0.371550
   beta   -0.352099 -2.543015
Z  aplpha -0.055688  1.662385

In [13]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

In [14]:
dataset2_group.mean()

           dataset2
k1 k2
X  alpha   0.438221
   beta   -0.643389
Y  alpha   0.371550
   beta   -2.543015
Z  aplpha  1.662385

In [15]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [17]:
for name, group in dframe.groupby('k1'):
    print('This is the {} group'.format(name))
    print(group)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -1.838315  0.438221
1  X   beta -1.409514 -0.643389


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -1.004341  0.371550
3  Y   beta -0.352099 -2.543015


This is the Z group
  k1      k2  dataset1  dataset2
4  Z  aplpha -0.055688  1.662385

In [19]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print('Key1={} Key2={}'.format(k1,k2))
    print(group)
    print('\n')

Key1=X Key2=alpha
  k1     k2  dataset1  dataset2
0  X  alpha -1.838315  0.438221


Key1=X Key2=beta
  k1    k2  dataset1  dataset2
1  X  beta -1.409514 -0.643389


Key1=Y Key2=alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -1.004341   0.37155


Key1=Y Key2=beta
  k1    k2  dataset1  dataset2
3  Y  beta -0.352099 -2.543015


Key1=Z Key2=aplpha
  k1      k2  dataset1  dataset2
4  Z  aplpha -0.055688  1.662385

In [20]:
gr = dframe.groupby('k1')

In [21]:
gr.get_group('X')

  k1     k2  dataset1  dataset2
0  X  alpha -1.838315  0.438221
1  X   beta -1.409514 -0.643389

In [22]:
group_dict = dict(list(dframe.groupby('k1')))

In [23]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -1.838315  0.438221
1  X   beta -1.409514 -0.643389

In [24]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [25]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -1.838315  0.438221
 1 -1.409514 -0.643389
 2 -1.004341  0.371550
 3 -0.352099 -2.543015
 4 -0.055688  1.662385, dtype('O'):   k1      k2
 0  X   alpha
 1  X    beta
 2  Y   alpha
 3  Y    beta
 4  Z  aplpha}